Terraform Plan:
```aws_eip.nat_eip: Refreshing state... [id=eipalloc-013904bf197fc22ee]
aws_lb.grafana_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:loadbalancer/app/grafana-alb/9da52d4f8839500b]
aws_iam_role.ec2_instance_role: Refreshing state... [id=ec2-instance-role-generic]
aws_cloudwatch_log_group.ecs_log_group: Refreshing state... [id=/ecs/siem]
aws_ebs_volume.gp3_volume_prometheus: Refreshing state... [id=vol-099aaae27ba9c2e1d]
aws_ebs_volume.gp3_volume_wazuh-indexer: Refreshing state... [id=vol-0fef670bbba91e14b]
aws_ebs_volume.gp3_volume_grafana: Refreshing state... [id=vol-046731b68b9381cc7]
aws_vpc.main: Refreshing state... [id=vpc-03e05ec4d7ef91467]
aws_iam_role_policy_attachment.ssm_managed_instance_core: Refreshing state... [id=ec2-instance-role-generic-20240126004538591100000001]
aws_iam_role_policy_attachment.cloudwatch_agent_server_policy: Refreshing state... [id=ec2-instance-role-generic-20240126004538603800000002]
aws_iam_instance_profile.ec2_instance_profile: Refreshing state... [id=ec2-instance-profile]
aws_internet_gateway.gw: Refreshing state... [id=igw-04d2dae30427425bb]
aws_subnet.public1: Refreshing state... [id=subnet-03d02c1913e5a7e17]
aws_lb_target_group.grafana_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/21e0efed84b17b1a]
aws_subnet.private1: Refreshing state... [id=subnet-0a892d70c825f21bc]
aws_security_group.all: Refreshing state... [id=sg-022d663f4177b31cd]
aws_subnet.private2: Refreshing state... [id=subnet-0c554a1b8323b1de4]
aws_subnet.public2: Refreshing state... [id=subnet-0aaf48c52ec90dd1a]
aws_route_table.public: Refreshing state... [id=rtb-07d5e5349f9e26179]
aws_route_table_association.public2: Refreshing state... [id=rtbassoc-090db73de77cde073]
aws_route_table_association.public1: Refreshing state... [id=rtbassoc-029d604ae22b397e3]
module.ec2_wazuh-indexer-01.aws_instance.this[0]: Refreshing state... [id=i-020ee2d56341b4bd9]
aws_nat_gateway.nat: Refreshing state... [id=nat-087a3050e779ad781]
module.ec2_prometheus.aws_instance.this[0]: Refreshing state... [id=i-0e7de500b79a83df6]
module.ec2_grafana.aws_instance.this[0]: Refreshing state... [id=i-08bd6045feda93592]
aws_lb_listener.grafana_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:listener/app/grafana-alb/9da52d4f8839500b/73d6036069ea6daa]
aws_route_table.private: Refreshing state... [id=rtb-0ac24f37859269d8f]
aws_route_table_association.private1: Refreshing state... [id=rtbassoc-01b8de58aaedb4470]
aws_route_table_association.private2: Refreshing state... [id=rtbassoc-02605b946f56d70ea]
aws_volume_attachment.ebs_att_prometheus: Refreshing state... [id=vai-3835864464]
aws_volume_attachment.ebs_att_wazuh-indexer-01: Refreshing state... [id=vai-2087835945]
aws_volume_attachment.ebs_att_grafana: Refreshing state... [id=vai-465159468]
aws_lb_target_group_attachment.grafana_attachment: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/21e0efed84b17b1a-20240126003225435200000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lb.grafana_alb will be destroyed
  # (because aws_lb.grafana_alb is not in configuration)
  - resource "aws_lb" "grafana_alb" {
      - arn                                         = "arn:aws:elasticloadbalancing:us-east-1:941133421128:loadbalancer/app/grafana-alb/9da52d4f8839500b" -> null
      - arn_suffix                                  = "app/grafana-alb/9da52d4f8839500b" -> null
      - desync_mitigation_mode                      = "defensive" -> null
      - dns_name                                    = "grafana-alb-1929827193.us-east-1.elb.amazonaws.com" -> null
      - drop_invalid_header_fields                  = false -> null
      - enable_cross_zone_load_balancing            = true -> null
      - enable_deletion_protection                  = false -> null
      - enable_http2                                = true -> null
      - enable_tls_version_and_cipher_suite_headers = false -> null
      - enable_waf_fail_open                        = false -> null
      - enable_xff_client_port                      = false -> null
      - id                                          = "arn:aws:elasticloadbalancing:us-east-1:941133421128:loadbalancer/app/grafana-alb/9da52d4f8839500b" -> null
      - idle_timeout                                = 60 -> null
      - internal                                    = false -> null
      - ip_address_type                             = "ipv4" -> null
      - load_balancer_type                          = "application" -> null
      - name                                        = "grafana-alb" -> null
      - preserve_host_header                        = false -> null
      - security_groups                             = [
          - "sg-022d663f4177b31cd",
        ] -> null
      - subnets                                     = [
          - "subnet-03d02c1913e5a7e17",
          - "subnet-0aaf48c52ec90dd1a",
        ] -> null
      - tags                                        = {} -> null
      - tags_all                                    = {} -> null
      - vpc_id                                      = "vpc-03e05ec4d7ef91467" -> null
      - xff_header_processing_mode                  = "append" -> null
      - zone_id                                     = "Z35SXDOTRQ7X7K" -> null

      - access_logs {
          - enabled = false -> null
        }

      - connection_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-03d02c1913e5a7e17" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0aaf48c52ec90dd1a" -> null
        }
    }

  # aws_lb.soc_alb will be created
  + resource "aws_lb" "soc_alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "grafana-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-022d663f4177b31cd",
        ]
      + subnets                                                      = [
          + "subnet-03d02c1913e5a7e17",
          + "subnet-0aaf48c52ec90dd1a",
        ]
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # aws_lb_listener.grafana_listener must be replaced
-/+ resource "aws_lb_listener" "grafana_listener" {
      ~ arn               = "arn:aws:elasticloadbalancing:us-east-1:941133421128:listener/app/grafana-alb/9da52d4f8839500b/73d6036069ea6daa" -> (known after apply)
      ~ id                = "arn:aws:elasticloadbalancing:us-east-1:941133421128:listener/app/grafana-alb/9da52d4f8839500b/73d6036069ea6daa" -> (known after apply)
      ~ load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:941133421128:loadbalancer/app/grafana-alb/9da52d4f8839500b" # forces replacement -> (known after apply) # forces replacement
      + ssl_policy        = (known after apply)
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ default_action {
          ~ order            = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_lb_listener.wazuh_listener will be created
  + resource "aws_lb_listener" "wazuh_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 81
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.wazuh_tg will be created
  + resource "aws_lb_target_group" "wazuh_tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "wazuh-tg"
      + name_prefix                        = (known after apply)
      + port                               = 5601
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-03e05ec4d7ef91467"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200-299"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }
    }

  # aws_lb_target_group_attachment.wazuh_attachment will be created
  + resource "aws_lb_target_group_attachment" "wazuh_attachment" {
      + id               = (known after apply)
      + port             = 5601
      + target_group_arn = (known after apply)
      + target_id        = "i-020ee2d56341b4bd9"
    }

  # module.ec2_wazuh-indexer-01.aws_instance.this[0] will be updated in-place
  ~ resource "aws_instance" "this" {
        id                                   = "i-020ee2d56341b4bd9"
        tags                                 = {
            "Environment" = "prod"
            "Name"        = "wazuh-indexer-01"
            "Terraform"   = "true"
        }
      ~ volume_tags                          = {
          ~ "Name" = "wazuh_indexer_01_persistence" -> "wazuh-indexer-01"
        }
        # (30 unchanged attributes hidden)

        # (10 unchanged blocks hidden)
    }

Plan: 5 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```